app/controllers/api/v1/airlines_controller.rb

SELECT "airlines".* FROM "airlines"
---
        def index
          airlines = Airline.all

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "fake-airlines"], ["LIMIT", 1]]
---
        def show
          airline = Airline.find_by(slug: params[:slug])

INSERT INTO "airlines" ("name", "image_url", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Fake airlines "], ["image_url", nil], ["slug", "fake-airlines"], ["created_at", "2022-08-16 13:23:51.183471"], ["updated_at", "2022-08-16 13:23:51.183471"]]
---
        def create
          airline = Airline.new(airline_params)

          if airline.save

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "fake-airlines"], ["LIMIT", 1]]
UPDATE "airlines" SET "name" = $1, "updated_at" = $2 WHERE "airlines"."id" = $3  [["name", "NEW FAKE AIRLINES"], ["updated_at", "2022-08-16 13:32:15.174269"], ["id", 43]]
---
        def update
          airline = Airline.find_by(slug: params[:slug])

          if airline.update(airline_params)

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "fake-airlines"], ["LIMIT", 1]]
DELETE FROM "airlines" WHERE "airlines"."id" = $1  [["id", 43]]
---
        def destroy
          airline = Airline.find_by(slug: params[:slug])

          if airline.destroy